import streamlit as st

# --- НАЛАШТУВАННЯ БЕЗПЕКИ ТА КОРИСТУВАЧІВ ---
SUPABASE_URL = st.secrets["SUPABASE_URL"]
SUPABASE_KEY = st.secrets["SUPABASE_KEY"]

headers = {
    "apikey": SUPABASE_KEY,
    "Authorization": f"Bearer {SUPABASE_KEY}",
    "Content-Type": "application/json",
    "Content-Profile": "public",
    "Accept-Profile": "public",
    "Prefer": "return=representation",
}

upload_headers = {
    "apikey": SUPABASE_KEY,
    "Authorization": f"Bearer {SUPABASE_KEY}",
    "Content-Type": "image/jpeg",
}

ICON_URL = "https://ajkprfhuypcamnybqusr.supabase.co/storage/v1/object/public/assets/xHJLUtG-wHDFARC-LtBbXJE_original.png?v=2"

# СЛОВНИК КОРИСТУВАЧІВ ТА ПРАВ ДОСТУПУ
USERS = {
    "2000": {
        "name": "Юля",
        "role": "read_only",
        "tabs": ["Касса", "Архів", "Сличительная"],
    },
    "2003": {
        "name": "Вероника",
        "role": "edit_recent",
        # "tabs": ["Касса", "Архів", "Сличительная", "Закупки", "Посуда"]
    },
    "2323": {
        "name": "Юра",
        "role": "edit_recent",
        # "tabs": ["Касса", "Архів",]
    },
    "1907": {
        "name": "Богдан",
        "role": "admin",
        # "tabs": ["Касса", "Архів", "Сличительная", "Закупки", "Посуда"]
    },
    "2025": {"name": "Іра", "role": "pnl_only", "tabs": ["Сличительная"]},
}

# --- КАТЕГОРІЇ ---
INCOME_CATEGORIES = ["Касса", "Дотация", "Р/С", "Разное"]

EXPENSE_TREE = {
    "Выдача денег/взаимозачёты": [
        "Материальная помощь собственникам",
        "Пополнение р/с",
    ],
    "FOOD COST / себестоимость продуктов": ["продукты", "проработки кухня/бар"],
    "WASTE technology / списание на технологию": ["вода питьевая"],
    "PAPER COST / упаковка": ["Посуда с собой"],
    "LABOR / расходы по зарплате": ["Зарплата", "зп по факту"],
    "UTILITIES / коммунальные услуги": [
        "вода/канализация",
        "директор жек",
        "электроенергия",
    ],
    "COMMUNICATION SERVICES / услуги связи и ТВ": ["мобильная связь"],
    "OPERATING SUPPLIES / хоз. материалы": [
        "Хозтовары + хоз.инвентарь",
        "канцтовары",
    ],
    "WARE, STOCK & LINEN / посуда, инвентарь, униформа, текстиль": [
        "посуда для зала",
        "форма официанты",
        "текстиль для зала",
        "барный/кухонный инвентарь",
    ],
    "MAINTENANCE & REPAIR / техобслуживание и ремонт": [
        "вентиляционных систем",
        "осмос",
        "жироулавливатели",
        "кухонного оборудования",
        "ремонт мебели",
        "фисной техники",
        "прочий ремонт",
        "ТМЦ для ремонта (расходники)",
    ],
    "OUTSIDE SERVICES / услуги внешних организаций": [
        "услуги дизайнера/художника",
        "реклама вакансий",
        "озеленение (ТМЦ)",
        "прочие услуги внешних организаций",
    ],
    "PROMOTION / продвижение": [
        "меню choice/smap/knaipa",
        "типография / брендированная продукция",
    ],
    "TRANSPORT / транспорт и топливо": [
        "заправка газ. балона",
        "новая почта",
        "такси",
        "транспорт",
    ],
    "MISCELLANEOUS / разное": ["аптечка", "прочее", "декорации (ТМЦ)"],
    "Аренда": ["аренда помещения", "аренда подвала"],
    "MARKETING / маркетинговые расходы": ["маркетинговые активности"],
}

EXPENSE_CHOICES = []
for group, subs in EXPENSE_TREE.items():
    for sub in subs:
        EXPENSE_CHOICES.append(f"{group} ➔ {sub}")

SUPPLIES_CATEGORIES = [
    "Губки, мочалки, салфетки для уборки, мопы и инвентарь",
    "Перчатки и одноразовая одежда",
    "Пакеты для мусора",
    "Бумажная продукция (полотенца, туалетная бумага, салфетки)",
    "Бытовая химия, моющие и дезинфицирующие средства",
    "Кассовая лента, канцтовары и прочие расходники",
    "Пакеты (фасовка, вакуум, ZIP), пленка, фольга и пергамент",
    "Приборы, шпажки, соломка и мешалки",
    "Упаковка, контейнеры, стаканы, крышки, емкости и бутылки"
]
